{
  "app_title": "Mau Plus",
  "settings": "Cài Đặt",
  "enable_notifications": "Bật thông báo",
  "language": "Ngôn ngữ",
  "dark_mode": "Chế độ tối",
  "privacy_policy": "Chính sách bảo mật",
  "privacy_policy_message": "Tại Blood Plus, chúng tôi cam kết bảo vệ quyền riêng tư của bạn. Chúng tôi thu thập thông tin cá nhân như tên, email, số điện thoại và dữ liệu hiến máu để cung cấp dịch vụ tốt nhất. Dữ liệu của bạn được mã hóa và chỉ chia sẻ với các tổ chức y tế được ủy quyền khi cần thiết. Bạn có thể yêu cầu xóa dữ liệu bất kỳ lúc nào. Để biết thêm chi tiết, vui lòng liên hệ qua email: support@bloodplus.com.",
  "save_settings": "Lưu cài đặt",
  "saved_settings": "Đã lưu cài đặt",
  "profile": "Hồ Sơ",
  "user_info": "Thông tin người dùng",
  "app_info": "Thông tin ứng dụng",
  "donation_history": "Lịch sử hiến máu",
  "logout": "Đăng xuất",
  "support": "Hỗ trợ",
  "logout_confirm_title": "Xác nhận đăng xuất",
  "logout_confirm_message": "Bạn có chắc chắn muốn đăng xuất?",
  "cancel": "Hủy",
  "confirm": "Xác nhận",
  "logout_success_title": "Đăng xuất thành công",
  "logout_success_message": "Bạn đã đăng xuất khỏi ứng dụng.",
  "ok": "OK",
  "news": "Tin Tức",
  "donation_times": "Lần hiến máu",
  "schedule_donation": "Đặt Lịch\nHiến Máu",
  "emergency_donation": "Hiến Máu\nKhẩn Cấp!",
  "nearby_hospitals": "Bệnh viện\nGần Đây",
  "highlighted_events": "Sự Kiện\nNổi Bật",
  "expert_advice": "Lời khuyên Chuyên Gia",
  "information": "Các thông\ntin",
  "blood_donation": "Hiến Máu",
  "lets_get_started": "Bắt đầu nào!",
  "login_welcome_message": "Đăng nhập để trải nghiệm các tính năng chúng tôi cung cấp và giữ sức khỏe!",
  "login": "Đăng nhập",
  "sign_up": "Đăng ký",
  "create_account": "Tạo tài khoản",
  "enter_your_name": "Nhập tên của bạn",
  "enter_your_email": "Nhập email của bạn",
  "enter_your_password": "Nhập mật khẩu của bạn",
  "confirm_your_password": "Xác nhận mật khẩu của bạn",
  "please_fill_all_fields": "Vui lòng điền đầy đủ các trường.",
  "passwords_do_not_match": "Mật khẩu không khớp.",
  "sign_up_successful": "Đăng ký thành công",
  "account_created_successfully": "Tài khoản của bạn đã được tạo thành công!",
  "go_to_login": "Đi đến Đăng nhập",
  "already_have_account": "Đã có tài khoản?",
  "or_login_with": "hoặc đăng nhập bằng",
  "sign_in_with_google": "Đăng nhập bằng Google",
  "forgot_password": "Quên mật khẩu?",
  "login_successful": "Đăng nhập thành công",
  "welcome": "Chào mừng!",
  "go_to_home": "Đi đến Trang chủ",
  "dont_have_account": "Chưa có tài khoản?",
  "select_reset_method": "Chọn phương thức để đặt lại mật khẩu.",
  "email": "Email",
  "phone": "Điện thoại",
  "send_otp": "Gửi OTP",
  "please_enter_email_or_phone": "Vui lòng nhập email hoặc số điện thoại.",
  "please_enter_valid_email": "Vui lòng nhập email hợp lệ.",
  "please_enter_valid_phone": "Vui lòng nhập số điện thoại hợp lệ.",
  "enter_verification_code": "Nhập mã xác nhận",
  "enter_code_sent_to": "Nhập mã chúng tôi đã gửi đến {contact}",
  "please_enter_4_digit_code": "Vui lòng nhập mã 4 chữ số.",
  "verify": "Xác nhận",
  "didnt_receive_code": "Không nhận được mã?",
  "resend": "Gửi lại",
  "otp_resent": "OTP đã được gửi lại.",
  "create_new_password": "Tạo mật khẩu mới",
  "create_password_to_login": "Tạo mật khẩu mới để đăng nhập",
  "enter_new_password": "Nhập mật khẩu mới",
  "confirm_password": "Xác nhận mật khẩu",
  "password_min_length": "Mật khẩu phải có ít nhất 6 ký tự.",
  "password_reset_successful": "Đặt lại mật khẩu thành công",
  "password_reset_success_message": "Mật khẩu của bạn đã được đặt lại thành công!",
  "update_info": "Cập nhật thông tin",
  "personal_info": "Thông tin cá nhân",
  "phone_number": "Số điện thoại",
  "date_of_birth": "Ngày sinh",
  "role": "Vai trò",
  "organization_info": "Thông tin cơ quan",
  "please_enter": "Vui lòng nhập {field}",
  "save_info": "Lưu thông tin",
  "info_saved_successfully": "Thông tin đã được lưu thành công!",
  "home": "Trang chủ",
  "events": "Sự kiện",
  "history": "Lịch sử",
  "app_info_title": "Thông tin ứng dụng",
  "app_info_message": "Blood Plus là ứng dụng hỗ trợ hiến máu, kết nối người hiến máu với các trung tâm y tế. Phiên bản hiện tại: 1.0.0. Chúng tôi cam kết mang đến trải nghiệm tốt nhất để khuyến khích hiến máu và cứu giúp cộng đồng.",
  "support_title": "Hỗ trợ",
  "support_message": "Liên hệ với chúng tôi để được hỗ trợ về hiến máu hoặc sử dụng ứng dụng Blood Plus. Chúng tôi luôn sẵn sàng giúp bạn!",
  "support_email": "Email: support@bloodplus.com",
  "support_phone": "Điện thoại: +84 123 456 789",
  "contact_by_email": "Gửi email",
  "contact_by_phone": "Gọi điện",
  "close": "Đóng",
  "cannot_open_email": "Không thể mở ứng dụng email.",
  "cannot_make_call": "Không thể thực hiện cuộc gọi.",
  "before_donation": "Trước khi hiến máu",
  "before_donation_subtitle": "Chuẩn bị tốt để đảm bảo quá trình hiến máu an toàn và hiệu quả.",
  "eat_before_donation": "Ăn gì trước khi hiến máu",
  "eat_before_donation_subtitle": "Chế độ ăn uống hợp lý giúp bạn sẵn sàng cho việc hiến máu.",
  "after_donation": "Sau khi hiến máu",
  "after_donation_subtitle": "Chăm sóc bản thân để phục hồi nhanh chóng sau khi hiến máu.",
  "tip_hydrate": "Uống đủ nước",
  "tip_hydrate_desc": "Uống ít nhất 500ml nước trước khi hiến máu để duy trì huyết áp và tránh chóng mặt.",
  "tip_sleep": "Ngủ đủ giấc",
  "tip_sleep_desc": "Nghỉ ngơi 7-8 tiếng đêm trước khi hiến máu để cơ thể ở trạng thái tốt nhất.",
  "tip_eat_iron": "Ăn thực phẩm giàu sắt",
  "tip_eat_iron_desc": "Bổ sung thực phẩm như thịt đỏ, rau xanh hoặc ngũ cốc để tăng cường hemoglobin.",
  "tip_rest": "Nghỉ ngơi sau hiến máu",
  "tip_rest_desc": "Tránh hoạt động nặng trong 24 giờ và nghỉ ngơi đầy đủ để phục hồi.",
  "emergency_number_hotline": "Hotline",
  "donate_blood": "Hiến máu",
  "emergency_contacts": "Hotline",
  "donation_centers": "Hotline bệnh viện",
  "choose_the_blood_group": "Chọn nhóm máu của bạn",
  "who_can_donate": "Ai có thể hiến máu?",
  "who_can_donate_desc": "- Tất cả mọi người từ 18 - 60 tuổi, thực sự tình nguyện hiến máu của mình để cứu chữa người bệnh.\n- Cân nặng ít nhất là 45kg đối với phụ nữ, nam giới. Lượng máu hiến mỗi lần không quá 9ml/kg cân nặng và không quá 500ml mỗi lần.\n- Không bị nhiễm hoặc không có các hành vi lây nhiễm HIV và các bệnh lây nhiễm qua đường truyền máu khác.\n- Thời gian giữa 2 lần hiến máu là 12 tuần đối với cả Nam và Nữ.\n- Có giấy tờ tùy thân.",
  "who_can_donate_subtitle": "Tìm hiểu về tiêu chí đủ điều kiện để hiến máu.",
  "who_can't_donate": "Ai là người không nên hiến máu?",
  "who_can't_donate_desc": "- Người đã nhiễm hoặc đã thực hiện hành vi có nguy cơ nhiễm HIV, viêm gan B, viêm gan C, và các vius lây qua đường truyền máu.\n- Người có các bệnh mãn tính: tim mạch, huyết áp, hô hấp, dạ dày…",
  "who_can't_donate_subtitle": "Ai nên tránh hiến máu?",
  "my_blood": "Máu của tôi sẽ được làm những xét nghiệm gì?",
  "my_blood_desc": "- Tất cả những đơn vị máu thu được sẽ được kiểm tra nhóm máu (hệ ABO, hệ Rh), HIV, virus viêm gan B, virus viêm gan C, giang mai, sốt rét.\n- Bạn sẽ được thông báo kết quả, được giữ kín và được tư vấn (miễn phí) khi phát hiện ra các bệnh nhiễm trùng nói trên.",
  "my_blood_subtitle": "Các xét nghiệm được thực hiện trên máu hiến",
  "blood_component": "Máu gồm những thành phần và chức năng gì?",
  "blood_component_history": "Thành phần máu",
  "appointment_details": "Chi tiết Lịch hẹn",
  "all_appointments": "Tất cả cuộc hẹn",
  "upcoming": "Sắp diễn ra",
  "cancelled": "Đã hủy",
  "status_unknown": "Không xác định",
  "blood_component_desc": "Máu là một chất lỏng lưu thông trong các mạch máu của cơ thể, gồm nhiều thành phần, mỗi thành phần làm nhiệm vụ khác nhau:\n- Hồng cầu làm nhiệm vụ chính là vận chuyển oxy.\n- Bạch cầu làm nhiệm vụ bảo vệ cơ thể.\n- Tiểu cầu tham gia vào quá trình đông cầm máu.\n- Huyết tương: gồm nhiều thành phần khác nhau: kháng thể, các yếu tố đông máu, các chất dinh dưỡng...",
  "blood_component_subtitle": "Tìm hiểu về thành phần máu và vai trò của chúng",
  "why_people_need_blood": "Tại sao lại có nhiều người cần phải được truyền máu?",
  "why_people_need_blood_desc": "Mỗi giờ có hàng trăm người bệnh cần phải được truyền máu vì :\n- Bị mất máu do chấn thương, tai nạn, thảm hoạ, xuất huyết tiêu hoá...\n- Do bị các bệnh gây thiếu máu, chảy máu: ung thư máu, suy tuỷ xương, máu khó đông...\n- Các phương pháp điều trị hiện đại cần truyền nhiều máu: phẫu thuật tim mạch, ghép tạng...",
  "why_people_need_blood_subtitle": "Tại sao truyền máu lại quan trọng?",
  "current_blood": "Nhu cầu máu điều trị ở nước ta hiện nay?",
  "current_blood_desc": "- Mỗi năm nước ta cần khoảng 1.800.000 đơn vị máu điều trị.\n- Máu cần cho điều trị hằng ngày, cho cấp cứu, cho dự phòng các thảm họa, tai nạn cần truyền máu với số lượng lớn.\n- Hiện tại chúng ta đã đáp ứng được khoảng 54% nhu cầu máu cho điều trị.",
  "current_blood_subtitle": "Nhu cầu và nguồn cung máu tại Việt Nam",
  "why_need_id": "Tại sao khi tham gia hiến máu lại cần phải có giấy CCCD?",
  "why_need_id_desc": "Mỗi đơn vị máu đều phải có hồ sơ, trong đó có các thông tin về người hiến máu. Theo quy định, đây là một thủ tục cần thiết trong quy trình hiến máu để đảm bảo tính xác thực thông tin về người hiến máu.",
  "why_need_id_subtitle": "Tại sao cần giấy tờ tùy thân khi hiến máu?",
  "harmful_to_health": "Hiến máu nhân đạo có hại đến sức khoẻ không?",
  "harmful_to_health_desc": "Hiến máu theo hướng dẫn của thầy thuốc không có hại cho sức khỏe. Điều đó đã được chứng minh bằng các cơ sở khoa học và cơ sở thực tế:.\nCơ sở khoa học:\n- Máu có nhiều thành phần, mỗi thành phần chỉ có đời sống nhất định và luôn luôn được đổi mới hằng ngày. Ví dụ: Hồng cầu sống được 120 ngày, huyết tương thường xuyên được thay thế và đổi mới. Cơ sở khoa học cho thấy, nếu mỗi lần hiến dưới 1/10 lượng máu trong cơ thể thì không có hại đến sức khỏe.\n- Nhiều công trình nghiên cứu đã chứng minh rằng, sau khi hiến máu, các chỉ số máu có thay đổi chút ít nhưng vẫn nằm trong giới hạn sinh lý bình thường không hề gây ảnh hưởng đến các hoạt động thường ngày của cơ thể.\nCơ sở thực tế:\n- Thực tế đã có hàng triệu người hiến máu nhiều lần mà sức khỏe vẫn hoàn toàn tốt. Trên thế giới có người hiến máu trên 400 lần. Ở Việt Nam, người hiến máu nhiều lần nhất đã hiến gần 100 lần, sức khỏe hoàn toàn tốt.\n- Như vậy, mỗi người nếu thấy sức khoẻ tốt, không có các bệnh lây nhiễm qua đường truyền máu, đạt tiêu chuẩn hiến máu thì có thể hiến máu từ 3-4 lần trong một năm, vừa không ảnh hưởng xấu đến sức khoẻ của bản thân, vừa đảm bảo máu có chất lượng tốt, an toàn cho người bệnh.",
  "harmful_to_health_subtitle": "Hiến máu có an toàn cho sức khỏe không?",
  "benefits_for_voluntary": "Quyền lợi đối với người hiến máu tình nguyện?",
  "benefits_for_voluntary_desc": "Quyền lợi và chế độ đối với người hiến máu tình nguyện theo Thông tư số 05/2017/TT-BYT Quy định giá tối đa và chi phí phục vụ cho việc xác định giá một đơn vị máu toàn phần, chế phẩm máu đạt tiêu chuẩn:\n- Được khám và tư vấn sức khỏe miễn phí.\n- Được kiểm tra và thông báo kết quả các xét nghiệm máu (hoàn toàn bí mật): nhóm máu, HIV, virut viêm gan B, virut viêm gan C, giang mai, sốt rét. Trong trường hợp người hiến máu có nhiễm hoặc nghi ngờ các mầm bệnh này thì sẽ được Bác sỹ mời đến để tư vấn sức khỏe.\n- Được bồi dưỡng và chăm sóc theo các quy định hiện hành:\n+ Phục vụ ăn nhẹ tại chỗ: tương đương 30.000 đồng.\n+ Hỗ trợ chi phí đi lại (bằng tiền mặt): 50.000 đồng.\n+ Lựa chọn nhận quà tặng bằng hiện vật có giá trị như sau:\nMột đơn vị máu thể tích 250 ml: 100.000 đồng.\nMột đơn vị máu thể tích 350 ml: 150.000 đồng.\nMột đơn vị máu thể tích 450 ml: 180.000 đồng.\n+ Được cấp giấy chứng nhận hiến máu tình nguyện của Ban chỉ đạo hiến máu nhân đạo Tỉnh, Thành phố. Ngoài giá trị về mặt tôn vinh, giấy chứng nhận hiến máu có giá trị bồi hoàn máu, số lượng máu được bồi hoàn lại tối đa bằng lượng máu người hiến máu đã hiến. Giấy Chứng nhận này có giá trị tại các bệnh viện, các cơ sở y tế công lập trên toàn quốc.",
  "benefits_for_voluntary_subtitle": "Quyền lợi khi hiến máu tình nguyện",
  "can_get_infected": "Khi hiến máu có thể bị nhiễm bệnh không?",
  "can_get_infected_desc": "Kim dây lấy máu vô trùng, chỉ sử dụng một lần cho một người, vì vậy không thể lây bệnh cho người hiến máu.",
  "can_get_infected_subtitle": "Hiến máu có nguy cơ lây nhiễm bệnh không?",
  "prepare": "Ngày mai tôi sẽ hiến máu, tôi nên chuẩn bị như thế nào?",
  "prepare_desc": "- Tối nay bạn không nên thức quá khuya (ngủ trước 23:00).\n- Nên ăn và không uống rượu, bia trước khi hiến máu.\n- Mang giấy CCCD, đủ giấy tờ tùy thân và thẻ hiến máu(nếu có) khi đi hiến máu.",
  "prepare_subtitle": "Chuẩn bị cho việc hiến máu",
  "delayed_blood_donation": "Những trường hợp nào cần phải trì hoãn hiến máu?",
  "delayed_blood_donation_desc": "- Những người phải trì hoãn hiến máu trong 12 tháng kể từ thời điểm:\n+ Phục hồi hoàn toàn sau các can thiệp ngoại khoa.\n+ Khỏi bệnh sau khi mắc một trong các bệnh sốt rét, giang mai, lao, uốn ván, viêm não, viêm màng não.\n+ Kết thúc đợt tiêm vắc xin phòng bệnh dại sau khi bị động vật cắn hoặc tiêm, truyền máu, chế phẩm máu và các chế phẩm sinh học nguồn gốc từ máu.\n+ Sinh con hoặc chấm dứt thai nghén.\n- Những người phải trì hoãn hiến máu trong 06 tháng kể từ thời điểm:\n+ Xăm trổ trên da.\n+ Bấm dái tai, bấm mũi, bấm rốn hoặc các vị trí khác của cơ thể.\n+ Phơi nhiễm với máu và dịch cơ thể từ người có nguy cơ hoặc đã nhiễm các bệnh lây truyền qua đường máu.\n+ Khỏi bệnh sau khi mắc một trong các bệnh thương hàn, nhiễm trùng huyết, bị rắn cắn, viêm tắc động mạch, viêm tắc tĩnh mạch, viêm tuỷ xương, viêm tụy.\n- Những người phải trì hoãn hiến máu trong 04 tuần kể từ thời điểm:\n+ Khỏi bệnh sau khi mắc một trong các bệnh viêm dạ dày ruột, viêm đường tiết niệu, viêm da nhiễm trùng, viêm phế quản, viêm phổi, sởi, ho gà, quai bị, sốt xuất huyết, kiết lỵ, rubella, tả, quai bị.\n+ Kết thúc đợt tiêm vắc xin phòng rubella, sởi, thương hàn, tả, quai bị, thủy đậu, BCG.\n- Những người phải trì hoãn hiến máu trong 07 ngày kể từ thời điểm:\n+ Khỏi bệnh sau khi mắc một trong các bệnh cúm, cảm lạnh, dị ứng mũi họng, viêm họng, đau nửa đầu Migraine.\n+ Tiêm các loại vắc xin, trừ các loại đã được quy định tại Điểm c Khoản 1 và Điểm b Khoản 3 Điều này.\n- Một số quy định liên quan đến nghề nghiệp và hoạt động đặc thù của người hiến máu: những người làm một số công việc và thực hiện các hoạt động đặc thù sau đây chỉ hiến máu trong ngày nghỉ hoặc chỉ được thực hiện các công việc, hoạt động này sau khi hiến máu tối thiểu 12 giờ:\n+ Người làm việc trên cao hoặc dưới độ sâu: phi công, lái cần cẩu, công nhân làm việc trên cao, người leo núi, thợ mỏ, thủy thủ, thợ lặn.\n+ Người vận hành các phương tiện giao thông công cộng: lái xe buýt, lái tàu hoả, lái tàu thuỷ.\n+ Các trường hợp khác: vận động viên chuyên nghiệp, người vận động nặng, tập luyện nặng.",
  "delayed_blood_donation_subtitle": "Khi nào nên trì hoãn hiến máu?",
  "have_covid_19": "Tôi bị nhiễm Covid-19. Tôi có thể hiến máu sau khi hồi phục không?",
  "have_covid_19_desc": "Khi mắc bệnh Covid-19, có thể tham gia hiến máu sau: 14 ngày kể từ thời điểm có kết quả khẳng định \"ÂM TÍNH\" với virus SarS-CoV-2",
  "have_covid_19_subtitle": "Hiến máu sau khi hồi phục COVID-19",
  "feeling_unsafe": "Khi phát hiện bất thường, cảm thấy không an toàn với túi máu vừa hiến",
  "feeling_unsafe_desc": "Sau khi tham gia hiến máu, nếu phát hiện có bất cứ điều gì khiến bạn cảm thấy không an toàn với túi máu vừa hiến (chợt nhớ ra 1 hành vi nguy cơ, có sử dụng loại thuốc nào đó mà bạn quên báo bác sĩ khi thăm khám, có xét nghiệm \"DƯƠNG TÍNH\" với SarS-CoV-2 bằng kỹ thuật test nhanh hoặc Real time RT-PCR,...) vui lòng báo lại cho đơn vị tiếp nhận túi máu nơi mà bạn đã tham gia hiến.",
  "feeling_unsafe_subtitle": "Làm gì nếu lo lắng về máu đã hiến?",
  "feeling_unwell": "Cảm thấy không khỏe sau khi hiến máu?",
  "feeling_unwell_desc": "Sau khi hiến máu, nếu có các triệu chứng chóng mặt, mệt mỏi, buồn nôn,... hãy liên hệ ngay cho đơn vị tiếp nhận máu để được hỗ trợ về mặt y khoa.",
  "feeling_unwell_subtitle": "Xử lý cảm giác khó chịu sau khi hiến máu",
  "swelling_or_bruising": "Có dấu hiệu sưng, phù nơi vết chích?",
  "swelling_or_bruising_desc": "Sau khi hiến máu, nếu bạn có các dấu hiệu sưng, phù nơi vết chích. Xin đừng quá lo lắng, hãy chườm lạnh ngay vị trí sưng đó và theo dõi các dấu hiệu trên, nếu không giảm sau 24 giờ hãy liên hệ lại cho đơn vị tiếp nhận máu để được hỗ trợ.",
  "swelling_or_bruising_subtitle": "Xử lý sưng hoặc bầm tím sau khi hiến máu",
  "donation_process": "Quy trình hiến máu diễn ra như thế nào?",
  "donation_process_desc": "1. Đăng ký và khai báo y tế.\n2. Kiểm tra sức khỏe (huyết áp, hemoglobin).\n3. Hiến máu (khoảng 5-10 phút).\n4. Nghỉ ngơi và ăn nhẹ sau hiến máu.",
  "donation_process_subtitle": "Hiểu các bước trong quá trình hiến máu.",
  "how_often_donate": "Tôi có thể hiến máu bao lâu một lần?",
  "how_often_donate_desc": "Nam giới có thể hiến máu 3 tháng/lần, nữ giới 4 tháng/lần, với điều kiện sức khỏe tốt.",
  "how_often_donate_subtitle": "Biết tần suất bạn có thể hiến máu.",
  "donation_risks": "Hiến máu có rủi ro không?",
  "donation_risks_desc": "Hiến máu an toàn nếu bạn khỏe mạnh. Một số người có thể cảm thấy chóng mặt hoặc mệt mỏi nhẹ, nhưng sẽ phục hồi nhanh nếu nghỉ ngơi và uống đủ nước.",
  "donation_risks_subtitle": "Tìm hiểu về rủi ro tiềm ẩn và cách giảm thiểu chúng.",
  "search": "Tìm kiếm",
  "notifications_not_implemented": "Tính năng thông báo chưa được triển khai",
  "view_location": "Xem vị trí",
  "call": "Gọi",
  "days_left": "Còn {days} ngày",
  "donation_day_count_message": "Bạn sẽ đủ điều kiện hiến máu sau {days} ngày nữa. Hãy chuẩn bị sức khỏe để giúp đỡ cộng đồng!",
  "donation_day_count_title": "Hiến máu – Nghĩa cử cao đẹp",
  "donation_today_message": "Hôm nay bạn đã đủ điều kiện hiến máu! Hãy đến điểm hiến máu gần nhất để chia sẻ sự sống.",
  "donation_today_title": "Bạn đã sẵn sàng hiến máu!",
  "login_failed": "Đăng nhập thất bại: {statusCode} - {message}",
  "connection_error": "Lỗi kết nối: {error}",
  "job": "Nghề nghiệp",
  "donation_count": "Số lần hiến máu",
  "passport_number": "Số Passport",
  "gender": "Giới tính",
  "male": "Nam",
  "female": "Nữ",
  "other": "Khác",
  "invalid_phone_number": "Làm ơn hãy nhập chính xác số điện thoại!",
  "no_blogs_available": "Không có bài viết nào",
  "views": "lượt xem",
  "page": "Trang",
  "blog_list": "Danh sách tin tức",
  "blog_title": "Tin tức",
  "no_blogs": "Không có blog nào",
  "error_loading_blogs": "Lỗi khi tải blog",
  "refresh": "Làm mới",
  "author_label": "Tác giả: {author}",
  "views_label": "Lượt xem: {views}",
  "no_content": "Không có nội dung",
  "privacy_policy_title": "Chính sách bảo mật",
  "latest_blogs": "Tin mới nhất",
  "view_detail": "Xem chi tiết",
  "view_all": "Tất cả",
  "donation_events": "Sự Kiện Hiến Máu",
  "search_by_location": "Tìm kiếm theo địa điểm...",
  "search_by_organization": "Tìm kiếm theo đơn vị tổ chức...",
  "select_start_date": "Chọn ngày bắt đầu",
  "select_end_date": "Chọn ngày kết thúc",
  "clear_filters": "Xóa bộ lọc",
  "no_events_found": "Không tìm thấy sự kiện nào",
  "location": "Địa điểm",
  "organization": "Tổ chức",
  "Full": "Đã đủ",
  "date": "Ngày",
  "time": "Thời gian",
  "time_title": "Thời gian sự kiện",
  "participants": "Số người tham gia",
  "of": "/",
  "confirm_schedule_donation": "Bạn có muốn đặt lịch cho sự kiện hiến máu này không?",
  "donation_form": "Mẫu Đăng Ký Hiến Máu",
  "qr_code": "Mã QR",
  "blood_component_1": "Thành Phần Máu",
  "has_donated_before": "Bạn đã từng hiến máu trước đây chưa?",
  "has_diseases": "Bạn có mắc bệnh gì không?",
  "disease_details": "Chi Tiết Bệnh",
  "is_taking_medicine": "Bạn có đang dùng thuốc không?",
  "medicine_details": "Chi Tiết Thuốc",
  "symptoms": "Triệu Chứng (ví dụ: sốt, ho)",
  "risk_behavior": "Hành Vi Nguy Cơ (ví dụ: sử dụng ma túy, hành vi không an toàn)",
  "travel_history": "Lịch Sử Du Lịch Gần Đây",
  "tattoo_or_surgery": "Xăm Hình hoặc Phẫu Thuật Trong Năm Qua",
  "weight_over_45kg": "Cân nặng của bạn trên 45kg chứ?",
  "notes": "Ghi Chú Bổ Sung",
  "event_details": "Chi tiết sự kiện",
  "submit": "Gửi",
  "form_submitted_successfully": "Đặt lịch thành công!",
  "could_not_launch_google_maps": "Không thể mở Google Maps",
  "no_google_maps": "Không tìm thấy Google Maps",
  "open_in_browser": "Không có Google Maps. Bạn có muốn mở trong trình duyệt không?",
  "open": "Mở",
  "location_permission_denied": "Quyền truy cập vị trí bị từ chối. Vui lòng cho phép trong cài đặt.",
  "location_permission_denied_forever": "Quyền truy cập vị trí bị từ chối vĩnh viễn. Vui lòng kiểm tra cài đặt.",
  "location_not_available": "Không thể lấy vị trí hiện tại.",
  "error_loading_hospitals": "Lỗi khi tải danh sách bệnh viện.",
  "nearby_hospital": "Bệnh viện gần đây",
  "invalid_blood_component": "Vui lòng chọn một thành phần máu hợp lệ",
  "disease_details_required": "Chi tiết bệnh là bắt buộc",
  "medicine_details_required": "Chi tiết thuốc là bắt buộc",
  "symptoms_required": "Triệu chứng là bắt buộc",
  "risk_behavior_required": "Hành vi rủi ro là bắt buộc",
  "travel_history_required": "Lịch sử đi lại là bắt buộc",
  "tattoo_or_surgery_required": "Chi tiết xăm hoặc phẫu thuật là bắt buộc",
  "notes_required": "Ghi chú là bắt buộc",
  "description": "Mô tả chi tiết",
  "has_previous_infections": "Trước đây, anh/chị có từng mắc những trạng thái bệnh: viêm gan siêu vi B, C, HIV, vảy nến, phụ nữ đang trong thời kỳ hành kinh, sỏi thận, tai biến mạch máu não, nhồi máu cơ tim, lupus ban đỏ, động kinh, ung thư, hen, dục cấy ghép mô tạng?",
  "previous_infections_details": "Chi tiết bệnh khác (nếu có)",
  "previous_infections_details_required": "Vui lòng nhập chi tiết bệnh",
  "had_recent_illness_12_months": "Trong 12 tháng gần đây, anh/chị có khỏi bệnh sau khi mắc những trạng tháiGRAY bệnh: sốt rét, giang mai, lao, viêm não-màng não, uốn ván, phù thủng ngoại khoa, được truyền máu hoặc cấy ghép mô, tiêm vacxin?",
  "recent_illness_12_months_details": "Chi tiết bệnh hoặc tình trạng",
  "recent_illness_12_months_details_required": "Vui lòng nhập chi tiết bệnh hoặc tình trạng",
  "had_recent_illness_6_months": "Trong 06 tháng gần đây, anh/chị có khỏi bệnh sau khi mắc những trạng thái bệnh: thương hàn, nhiễm trùng máu, bị rắn cắn, viêm tắc động mạch, viêm tắc tĩnh mạch, viêm tủy, viêm tủy xương, sút cân nhanh không rõ nguyên nhân, nổi hạch kéo dài, thực hiện thủ thuật y tế xâm lấn (chữa răng, châm cứu, lăn kim, nốt sùi...), xâm, xỏ lỗ tai, lỗ mũi hoặc xăm hình, sử dụng ma túy, tiếp xúc trực tiếp với máu, dịch tiết của người khác hoặc trong môi trường tiêm, sinh sống chung hoặc nghi ngờ nhiễm bệnh Viêm gan siêu vi B?",
  "had_recent_illness_1_month": "Trong 01 tháng gần đây, anh/chị có khỏi bệnh sau khi mắc bệnh viêm họng, sốt, ho gà, quai bị, sởi, quai bị, hủyệt, kiết lỵ, tả, Rubella, đi vắng hoặc có dịch bệnh lưu hành (sốt rét, sốt xuất huyết, Zika...)?",
  "had_recent_illness_14_days": "Trong 14 ngày gần đây, anh/chị có bị cắn, cảm lạnh, ho, nhức đầu, sốt, đau họng?",
  "recent_illness_14_days_details": "Chi tiết tình trạng khác (nếu có)",
  "recent_illness_14_days_details_required": "Vui lòng nhập chi tiết tình trạng",
  "used_antibiotics_7_days": "Trong 07 ngày gần đây, anh/chị có dùng thuốc kháng sinh, kháng viêm, Aspirin, Corticoid?",
  "antibiotics_details": "Chi tiết thuốc khác (nếu có)",
  "antibiotics_details_required": "Vui lòng nhập chi tiết thuốc",
  "is_pregnant_or_recent_mother": "Câu hỏi dành cho phụ nữ: Hiện chị đang mang thai hoặc nuôi con dưới 12 tháng tuổi, chậm dứt thai kỳ trong 12 tháng gần đây (sảy thai, phá thai, thai ngoài tử cung)?",
  "pregnancy_details": "Chi tiết tình trạng thai kỳ",
  "pregnancy_details_required": "Vui lòng nhập chi tiết tình trạng thai kỳ",
  "filter_events": "Lọc sự kiện",
  "register_now": "Hiến máu ngay",
  "our_services": "Các Loại Dịch Vụ",
  "blood_type": "Nhóm máu",
  "options": "Tùy chọn",
  "about": "About",
  "search_hint": "Từ khóa tìm kiếm",
  "read_more": "Đọc thêm",
  "search_blogs": "Tìm kiếm blogs",
  "blog_title_detail": "Tin tức & Bài viết sức khỏe",
  "explore": "Khám phá",
  "donation_form_des": "Vui lòng đọc & điền các thông tin sau. Điều này sẽ hỗ trợ rất nhiều cho bạn!",
  "language_vietnamese": "Tiếng Việt",
  "language_english": "Tiếng Anh",
  "general": "Chung",
  "loading": "Đang tải...",
  "error": "Lỗi",
  "blood_component_selection": "Lựa chọn thành phần máu",
  "basic_information": "Thông tin cơ bản",
  "health_information": "Thông tin sức khỏe",
  "recent_health_history": "Lịch sử sức khỏe gần đây",
  "additional_notes": "Ghi chú bổ sung",
  "pregnancy": "Phụ nữ mang thai",
  "user_qr_code": "Mã QR Cá Nhân",
  "event_information": "Thông tin sự kiện",
  "progress": "Tiến triển",
  "tap_to_open_maps": "Nhấn để mở bản đồ",
  "registered": "Đã đăng ký",
  "required": "Nhu cầu",
  "completed": "Đã hoàn thành",
  "your_appointments": "Cuộc hẹn của bạn",
  "no_appointments": "Không tìm thấy cuộc hẹn nào",
  "cancel_appointment": "Hủy cuộc hẹn",
  "confirm_cancel_appointment": "Bạn có chắc chắn muốn hủy cuộc hẹn này không?",
  "yes": "Có",
  "no": "Không",
  "total": "Tổng",
  "Pending": "Đang diễn ra",
  "Canceled": "Đã hủy",
  "Completed": "Đã hoàn thành",
  "no_appointments_message": "Bạn chưa có cuộc hẹn nào",
  "book_now": "Đặt lịch liền!",
  "cannot_cancel_non_pending": "Chỉ có thể hủy các cuộc hẹn đang chờ xử lý",
  "error_canceling_appointment": "Lỗi khi hủy cuộc hẹn",
  "appointment_canceled": "Cuộc hẹn đã được hủy thành công",
  "success": "Thành công",
  "mark_completed": "Hoàn thành",
  "complete_appointment": "Xác nhận đã hoàn thành",
  "confirm_complete_appointment": "Bạn có chắc chắn cuộc hẹn này là đã hoàn thành không?",
  "appointment_completed": "Cuộc hẹn đã được xác nhận là đã hoàn thành",
  "error_completion_appointment": "Đã xảy ra lỗi khi đánh dấu cuộc hẹn là đã hoàn thành",
  "cannot_complete_non_pending": "Chỉ có thể đánh dấu các cuộc hẹn đang chờ xử lý là đã hoàn thành",
  "cannot_open_maps": "Không thể mở Google Maps",
  "cannot_open_calendar": "Không thể mở Lịch",
  "tap_to_open_calendar": "Nhấn để mở Lịch"
}